<template>
  <div>
    <h1>コンテストサイト利用ガイド</h1>
    
    <h2>コンテストサイトとは？</h2>
    <p>
      コンテスト問題の閲覧・解答・質問を行うことが出来るサイトです。<br>
      各問題ごとに解答、質問を行ってください。
    </p>
    <p>
      本サイトは、Google Chrome 56にて動作確認を行っています。その他のブラウザは動作保証外となります。
    </p>
    <p>
      今回は、完答ボーナスやファーストブラッドはありません。
    </p>
    
    <h2>機能ごとの説明</h2>
    <h3>トップページ</h3>
    <p>お知らせや新着の質問などの通知を掲載しています。逐次目を通すようにしてください。</p>

    <h3>入力フォームと使える記法</h3>
    <h4>入力フォームボタンの機能</h4>
    <p>
      Bold, 
      斜体, 
      見出し, 
      引用, 
      リスト, 
      番号付きリスト, 
      リンク, 
      URLのある画像挿入, 
      プレビュー, 
      ライブプレビュー, 
      入力範囲の拡大・縮小, 
    </p>
    <h4>Markdown記法での入力</h4>
    <ul>
      <li>このコンテストサイトの質問や解答の入力欄ではMarkdown記法が利用できます。</li>
      <li>解答の際はMarkdownを使用して、採点者が読みやすい文章を記述してください。</li>
    </ul>

    <h3>解答</h3>
    <ul>
      <li>問題画面を開き、解答を記述してください。</li>
      <li>採点依頼をクリックするまで採点されることは有りません。</li>
      <li>解答を修正・削除できませんので、解答の内容の修正は追記にて行ってください。</li>
      <li>解答は採点されるまでの間、新たに投稿することができません。</li>
    </ul>

    <h3>質問</h3>
    <ul>
      <li>問題に対しての質問があった場合、該当の問題ページに有る質問フォームより投稿してください。</li>
      <li>質問が解決した場合、ラベルをクリックして[解決済]へと表示を切り替えてください。</li>
      <li>一旦解決済みへと変更しても、再度クリックすることによりステータスを戻すことができます。</li>
      <li>問題外の質問は、直接スタッフにお伝え下さい。</li>
    </ul>


  </div>
</template>

<style scoped>
h2 {
  border-bottom: 1px solid #ddd;
  margin: 4rem 0 1rem;
}
h3 {
  margin: 2rem 0 1rem;
}
h4 {
  margin: 1rem 0 1rem;
}
</style>

<script>
import { SET_TITLE } from '../store/'

export default {
  name: 'empty',
  data () {
    return {
    }
  },
  asyncData: {
  },
  computed: {
  },
  watch: {
  },
  mounted () {
    this.$store.dispatch(SET_TITLE, 'ページ名');
  },
  destroyed () {
  },
  methods: {
  },
}
</script>
